{
  "version": "https://jsonfeed.org/version/1",
  "title": "",
  "home_page_url": "https://mmdsharifi.com/",
  "feed_url": "https://mmdsharifi.com/feed/feed.json",
  "description": "",
  "author": {
    "name": "Mohammad Sharifi",
    "url": "https://mmdsharifi.com/"
  },
  "items": [{
      "id": "https://mmdsharifi.com/posts/2023/09/english-writing-challenge/",
      "url": "https://mmdsharifi.com/posts/2023/09/english-writing-challenge/",
      "title": "English writing challenge",
      "content_html": "<div class=\"col-start-3 col-end-9\">\n<h3 id=\"intro\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#intro\" target=\"_blank\" rel=\"noreferrer\">Intro</a></h3>\n<p>I would love to levelup my english skills through daily writing. I'll read script of podcasts and then write down my YouTube video scripts, revise them and then practice speaking by making a fun and cool video!<br>\nSo let's dive in 🏊‍♂️</p>\n<h3 id=\"day-01-%C2%B7-intro-script-%F0%9F%9A%80\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-01-%C2%B7-intro-script-%F0%9F%9A%80\" target=\"_blank\" rel=\"noreferrer\">Day 01 · Intro script 🚀</a></h3>\n<p>I love the mindset mentor podcast by Rob Dial. and I want to just practice very first second of each podcast in my first day, I'm super excited to do it!</p>\n<p>&quot;Welcome to today's video of the designer mindset channel. I'm your host Mohammad Sharifi. I you have not done yet, so hit the subscribe button, so that you neve miss another video. if you love this video, please do me a favor, all of you have to do, like and comment down bellew this video. the reason why is because the more likes and comments we get on this video, so YouTube show this video for people never watch it before which alow us to grow and make better video for you. if you do that I'll greatly apperetiate it. Today's topic...&quot;</p>\n<h3 id=\"day-02-%C2%B7-come-back-to-the-gym-%F0%9F%92%AA\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-02-%C2%B7-come-back-to-the-gym-%F0%9F%92%AA\" target=\"_blank\" rel=\"noreferrer\">Day 02 · Come back to the Gym 💪</a></h3>\n<p>I have remote working for almost 4 years. It can be boring and exhausting when you get used to doing your work every day from home. until I decide to go to the gym...</p>\n<p>Connecting with other people makes us feel good. When I was isolated at home, my connection was limited to my colleagues (remotely), a few friends outside, and most of my time at home. After months of procrastination, finally I went to the nearest gym. All of my hope was to connect with other places and people. It was great to find new cool friends there, plus it drops lots of dopamine in my body and I feel so sarzende and energetic in my work. I feel better about my body since I practice 4 days a week and almost for 2 months! Congrats to myself for this decision.</p>\n<h3 id=\"day-03-%C2%B7-spotify-learn-%F0%9F%8E%A7\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-03-%C2%B7-spotify-learn-%F0%9F%8E%A7\" target=\"_blank\" rel=\"noreferrer\">Day 03 · Spotify Learn 🎧</a></h3>\n<p>Imagine the Spotify app has a learning feature for language learners based on the lyrics and podcast transcripts.<br>\nI've used the Snipd app, totally love the AI features and I want to practice English with it, But haven't any learning features. I would like to add the learning feature to Spotify because it going to be much more fun if you learn through English music and podcasts. I can review words in the song or in the podcast in audio-based flashcards!<br>\nwith AI it is possible to generate a cool image to visualize it in a fun way! Also, I can talk with the AR bot about the vocabs I would like to learn, fantastic one! 😁</p>\n<h3 id=\"day-03-%C2%B7-dopamine-detax-%E2%9C%A8\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-03-%C2%B7-dopamine-detax-%E2%9C%A8\" target=\"_blank\" rel=\"noreferrer\">Day 03 · Dopamine Detax ✨</a></h3>\n<p>All of us use social apps daily, we'll check them when there is no reason to check just we used to check them regularly. they shape us a habbit to use it without thinking. so it's neccsseary to stay away from them even for a one day a week, I do it in weekend, this called dopamine detax, I try to minimize my useage of internet, my iPhone and macbook. it help us to remove all of sams from our brain. I digital minimalist book, and it's hightly recommended. Remember to use you electronic devieces and apps intentionaly and with a goal in mind.<br>\nI try to have offline hours everyday for myself, to think and relect on my toughts. here is what I do in the offline hours:</p>\n<ol>\n<li>Read a book</li>\n<li>Pick a pen and paper and write down all of your thoughts non-stop</li>\n<li>Take a shower</li>\n<li>Clean up your desk and home</li>\n<li>Visualize the feature</li>\n<li>Write down your wishlist</li>\n<li>Walk out</li>\n<li>Do a workout</li>\n<li>Go to the Gym</li>\n<li>Take 3 deep breth</li>\n</ol>\n<h3 id=\"day-04-%C2%B7-trust-god-%F0%9F%98%8C\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-04-%C2%B7-trust-god-%F0%9F%98%8C\" target=\"_blank\" rel=\"noreferrer\">Day 04 · Trust God 😌</a></h3>\n<p>Today I learned to trust God. You may have small, tiny plans for yourselves but god has better greater plans for me and you! So don’t let stress and anxiety of what will happen in the future for me, if this going happen so oh my god, that’s gonna be bad for me. You make the hell inside your mind and you make it even worse by overthinking about features! Oh, my dear friend don’t do that with yourself, don’t kill yourself in your handmade hell 😁.</p>\n<p>Stay relaxed and review your past you had amazing opportunities in your life all of them happened and you can’t find out why! Yes, it’s kind of a random event, but I tell you that’s god's plan because it’s better than yours so that may bother you. All of you have to trust god for his plan for you. If something does not happen right now, because god knows when and where this event should be occur to you ❤️‍🔥😉</p>\n<h3 id=\"day-05-%C2%B7-building-a-second-brain\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-05-%C2%B7-building-a-second-brain\" target=\"_blank\" rel=\"noreferrer\">Day 05 · Building a second brain</a></h3>\n<p>We are knowledge workers. we deal with lots of information every day it's vital to manage our personal information to be successful as a designer. recently I randomly found a YouTube video about how building a second brain him life organized and easier. I'm a huge fan of staying organized and being productive. Tiago Forte the author of &quot;Building second brain&quot; invented a system called CODE. It's similar to the double diamond (a design thinking framework):<br>\n<strong>Capture</strong>, what resonates with you,<br>\n<strong>Organize</strong> based on actionability,<br>\n<strong>Distil</strong> the information, tell it in your language, and finally<br>\n<strong>Express</strong> it, tell a new story to the world, share what you learned<br>\nIt's basically a note-taking system that helps me stay organized I used Apple Note and then I switched to Obsidiab. It's a life changer idea, highly recommend it!</p>\n<h3 id=\"day-06-%C2%B7-building-a-second-brain---capture-%26-organize\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-06-%C2%B7-building-a-second-brain---capture-%26-organize\" target=\"_blank\" rel=\"noreferrer\">Day 06 · Building a second brain - Capture &amp; Organize</a></h3>\n<p>Tonight I’d like to write about the details of building a second brain, a note taking system for organizing and managing personal information.<br>\nYou basically capture 2-3 interesting ideas, which can be surprising, inspiring, or personal like journaling. On weekends or any time, you feel it’s time to organize your notes. In your note taking app you create folders with the PARA method:</p>\n<ol>\n<li>Projects: the most actionable</li>\n<li>Areas</li>\n<li>Resources</li>\n<li>Archive</li>\n</ol>\n<p>List your 10-15 active projects, every project has a goal and a deadline. Otherwise, we call Area, like health, finance, parenting, etc. which is your area of responsibility. Anything that is useful for the feature goes to your resources folder. The last one is for archiving your inactive projects. Tomorrow I write about the other 2 stages.</p>\n<h3 id=\"day-06-%C2%B7-building-a-second-brain---distill-%26-express\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-06-%C2%B7-building-a-second-brain---distill-%26-express\" target=\"_blank\" rel=\"noreferrer\">Day 06 · Building a second brain - Distill &amp; Express</a></h3>\n<p>After taking notes for your projects and organizing them with the PARA method. It’s time to distill them. Summarize and highlight what’s important. The author used a 4 layer metaphor:</p>\n<ol>\n<li>The soil: your scraped notes</li>\n<li>The oil: make bold what’s important</li>\n<li>The gold: highlight the bold text</li>\n<li>The gym: write down a summary based on highlights.<br>\nFinally, it’s time to use this information to tell your story, inspire others, and create value. What’s the point of knowing something, if you collect notes and nobody, even yourself can’t utilize it. So share your work and get feedback regularly. You can change lives by sharing yourself with others.</li>\n</ol>\n<h3 id=\"day-07-%C2%B7-til%3A-problem-solving-tip\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-07-%C2%B7-til%3A-problem-solving-tip\" target=\"_blank\" rel=\"noreferrer\">Day 07 · TIL: Problem Solving Tip</a></h3>\n<p>I just opened the Apple Podcast app and scrolled to find a random episode to listen to while I do my work. One of them caught my eye which was about problem-solving. Wow as a designer I am always curious about this kind of skill. He talked about lots of ways to become better problem solvers in our lives.<br>\nHere is my tip for TIL (today I learned...) 📝 write down your problem in 100 words. Then try to describe it in 400 and 900 words, and finally magic ✨ will happen. you solve your problem by yourself. This is the magic of problem clarification. Write more about your challenge eventually, you'll find the solution/s inside it! You can try to write down 900 words, but 900 is not a magic number write till you'll find the solution.</p>\n<h3 id=\"day-08-%C2%B7-how-i-became-a-developer-then-a-designer%2C-part-1\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-08-%C2%B7-how-i-became-a-developer-then-a-designer%2C-part-1\" target=\"_blank\" rel=\"noreferrer\">Day 08 · How I became a Developer then a Designer, part 1</a></h3>\n<p>I’ve been a designer since almost 4 years ago. But let's flashback to the past and see how my design adventure started 😁. When I was a kid I went to my cousin, he was a computer geek and kind of programmer. Always I have fun in their house most of the time by playing games like IGA, FIFA 2002, chickens, and more. As I grew up, I became more curious about computers, one day I explored random places on Earth and I was amazed about how and who made this, I know it’s from Google. He taught me web design and development with Dreamviewer 🙃<br>\nI started to have my blog. I tried to customize the blog template by self-learning HTML and then CSS. It was an amazing experience I enjoyed a lot. At that time it was very common to design ad banners. So I found it very interesting and I designed some banners for my blog and forum! Tomorrow I will talk about how university changed my life!</p>\n<h3 id=\"day-09-%C2%B7-how-i-became-a-developer-then-a-designer%2C-part-2\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-09-%C2%B7-how-i-became-a-developer-then-a-designer%2C-part-2\" target=\"_blank\" rel=\"noreferrer\">Day 09 · How I became a Developer then a Designer, part 2</a></h3>\n<p>In 2012 I went to university to study software engineering, l was full of amazing dreams for my future. But it was heartbreaking 💔 to see there are a lot of courses not related to software. I decided to keep focus on courses that are relevant. I found a great friend with the same mindset and we tried to learn web development in the summer of 2013. We’re super enthusiastic 🤩 to learn as fast as possible. I want to work on front-end development and he focused on the backend. I remember the first project we worked on was a clinic website. Then I fell a love with Bootstrap Framework 2,3, and 4 😂. Then we work on a forum website and after that, an e-commerce online shop. Full of energy we eat every article, book, and video course to absorb all that lovely stuff. I also learned to use Linux and Git from other cool guys. Also, we share what we’ve learned as self-thought persons with our classmates. It was a very exciting experience as a web designer teacher.</p>\n<h3 id=\"day-10-%C2%B7-how-i-became-a-developer-then-a-designer%2C-part-3%2F3\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-10-%C2%B7-how-i-became-a-developer-then-a-designer%2C-part-3%2F3\" target=\"_blank\" rel=\"noreferrer\">Day 10 · How I became a Developer then a Designer, part 3/3</a></h3>\n<p>In the last term of university, I went to a company to work as a front-end developer. It was a pretty cool experience I learned a lot. After 4 months I decided to come back and study for my master's exam. I did it after almost 4 months I earned a rank of 142 among thousands of people. That was a great success in my life because now I can go to Tehran (the capital of Iran) and have a place almost for free, and work and find connections. I started working with a company inside our university it wasn't good enough. Again my friend joined Sepidz as a developer and designer. day after day I realized that design was better for me then I smoothly switched to becoming a designer.</p>\n<p>I picked interaction foundation courses to learn the fundamentals of UX design and design thinking. I learned a lot and really grew up with hard work. At the beginning of the pandemic I came back home with a master's degree and a great connection led me to my next job at the biggest software development company in Iran. with the designer manager, we started to work on a super huge design system for enterprise and complex CRMs. It was nice and challenging but it's time to go to the military for 2 years! Oh no, but I found a startup in the US and totally changed my life! I bought a new MacBook Pro and all the cool things. After the military, I came back to the system group and in their sub-company, cloud-based services. Abramad, as I work for almost 7 months there!</p>\n<h3 id=\"day-11-%C2%B7-remote-work%2C-good%2C-bad%2C-and-ugly\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#day-11-%C2%B7-remote-work%2C-good%2C-bad%2C-and-ugly\" target=\"_blank\" rel=\"noreferrer\">Day 11 · Remote work, good, bad, and ugly</a></h3>\n<p>Remote work looks appealing on social media and in YouTube videos. The images of lounging on the beach, enjoying a sunny day, making money, and sipping orange juice create an enticing narrative. However, the reality is different. Yes, I work from home and stay connected with my family, but after months, spending nearly 24 hours at home becomes frustrating and exhausting. I miss my passion for work, and on some days, I accomplish almost nothing.</p>\n<p>When I chose this lifestyle, I knew I had to make changes to be happier and more productive. Here are the tips I'd like to share with you:</p>\n<p><strong>🚶🏻 Morning Walks</strong>: Every morning, I make it a point to go out for a 30-minute walk and buy fresh bread for breakfast.</p>\n<p><strong>⏲️ Pomodoro Technique</strong>: I've embraced the Pomodoro technique to stay focused at work. It's a game-changer, allowing me to take breaks for renewed energy during and after work.</p>\n<p><strong>📚 Establishing Habits</strong>: Creating daily habits has been key to feeling great at the start and end of my day. From staying hydrated to combining a &quot;PodWalk&quot; (listening to podcasts while walking) and reading non-fiction books.</p>\n<p><strong>💪 Gym Sessions</strong>: The gym has become more than just a place to work out; it's where I reconnect with school friends, fostering greater happiness and energy levels. You can read more about this in Day 02 (link 🔝).</p>\n<p><strong>☕ Virtual Coffee Time</strong>: I've recommended to my colleagues to incorporate casual time for discussions about everything except work.</p>\n<p>I strive to make each day better and nurture the dream of someday working from the beach. ✨⛱️😁</p>\n<h3 id=\"todo\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#todo\" target=\"_blank\" rel=\"noreferrer\">TODO</a></h3>\n<ul>\n<li>use images</li>\n<li>write a blog post the favourite one!</li>\n<li>topics\n<ul>\n<li>Today I learned...</li>\n<li>what I were did as a front developer</li>\n<li>what I want to learn in the next 6 monthes</li>\n<li>what is my favorite country in the world, why?</li>\n<li>what's my favoirite movie and why?</li>\n<li>how I boost my enegy in middle of work day?</li>\n<li>how to work remote and stay enegized :D</li>\n</ul>\n</li>\n</ul>\n</div>\n",
      "date_published": "2023-09-20T00:00:00Z"
    },{
      "id": "https://mmdsharifi.com/posts/2023/04/notion-design-brief/",
      "url": "https://mmdsharifi.com/posts/2023/04/notion-design-brief/",
      "title": "Magic of writing Design Briefs, The Secrets to Project Success",
      "content_html": "<div class=\"col-start-3 col-end-9\">\n<h3 id=\"introduction\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#introduction\" target=\"_blank\" rel=\"noreferrer\">Introduction</a></h3>\n<p>Do you know what is the secret of professional designers to start their projects strongly?</p>\n<p>How to capture all essential elements of the project to understand needs, scope and align expectations from design to project success?</p>\n<p>A design brief is your magical weapon to show your professionalism and get started on your project in the right way!</p>\n<p>you might ask how? 🤔</p>\n<p>In this article, I talk about why and how to write a perfect design brief with help of my FREE Notion template. So let’s dive in, and see the magic 🪄</p>\n<h3 id=\"why-we-should-write-the-design-brief%3F\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#why-we-should-write-the-design-brief%3F\" target=\"_blank\" rel=\"noreferrer\">Why we should write the design brief?</a></h3>\n<p>Writing a design brief is your first step for any UI/UX or Product design project. But most of designers struggle with why and how to write it. Let’s talk about the importance and benefits of writing design briefs. Generally, it helps you to be more creative and productive.</p>\n<ul>\n<li>💎 By clearly understanding project requirements, objectives, constraints,  and target users</li>\n<li>⏱️ Make communication more effective and avoid lots of revisions and iteration</li>\n<li>😀 Deliver what exactly the client wants which is to make you client satisfied</li>\n<li>🚀 Increase your productivity by staying focused, prioritizing tasks, and allocate resources effectively</li>\n<li>😎 Presenting a comprehensive design brief demonstrates professionalism and attention to detail, enhancing your credibility as a designer.</li>\n</ul>\n<p>… and much more! what do you think?</p>\n<h3 id=\"how-to-write-design-brief%3F\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#how-to-write-design-brief%3F\" target=\"_blank\" rel=\"noreferrer\">How to write Design Brief?</a></h3>\n<p>Follow the step by step guide to write down your brief.</p>\n<h4 id=\"1)-download-free-notion-template\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#1)-download-free-notion-template\" target=\"_blank\" rel=\"noreferrer\">1) Download Free Notion Template</a></h4>\n<p>Considering all aspects of the project in the design brief can be quite challenging. But I made a Notion Design Brief template to make your life easier! if you like this magic template, you can buy me a coffee! ☕</p>\n<figure class=\"mb-10\"><img loading=\"lazy\" src=\"https://res.cloudinary.com/mmdsharifi/image/upload/q_auto,f_auto,w_400/965shots_so_p5orwe.webp\" srcset=\"https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_400/mmdsharifi.com/965shots_so_p5orwe.webp 400w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_600/mmdsharifi.com/965shots_so_p5orwe.webp 600w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_768/mmdsharifi.com/965shots_so_p5orwe.webp 768w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_820/mmdsharifi.com/965shots_so_p5orwe.webp 820w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_1240/mmdsharifi.com/965shots_so_p5orwe.webp 1240w\" alt=\"Notion Design Brief template Mockup\" width=\"400\" height=\"300\"><figcaption class=\"text-center text-sm mt-3 text-gray-600 dark:text-gray-200\">👇</figcaption></figure>\n <a href=\"https://mmdsharifi.gumroad.com/l/designbrief\" title=\"Download now\" target=\"_blank\" rel=\"noreferrer\" class=\"text-center text-blue-800 bg-blue-100 transition-colors hover:text-blue-100 hover:bg-blue-800 dark:text-red-900 dark:bg-blue-700 dark:hover:bg-blue-900 dark:hover:text-blue-900 font-bold tracking-tight text-lg py-3 px-5 mb-5 rounded-md inline-flex items-center justify-center\">\n            <svg class=\"inline-block w-5 h-5 mr-2\" xmlns=\"http://www.w3.org/2000/svg\" fill=\"none\" viewBox=\"0 0 24 24\" stroke=\"currentColor\">\n              <path stroke-linecap=\"round\" stroke-linejoin=\"round\" stroke-width=\"2\" d=\"M13 10V3L4 14h7v7l9-11h-7z\" />\n            </svg>\n            Download Free Notion Design Brief Template\n </a>\n<p>and create a <code>duplicate</code> of template to get started!</p>\n<h4 id=\"2)-write-it-down!\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#2)-write-it-down!\" target=\"_blank\" rel=\"noreferrer\">2) Write it down!</a></h4>\n<p>Now you have a brand new template with some question to ask your client. Next you need have a kickoff meeting with your client, to ask him/her questions that I provided in the template.<br>\nFeel free to customize it based on your project and needs. Also you can use it like a checklist to consider all aspect of project from background, market, product and design goals, like a pro! 😎</p>\n<h5 id=\"key-sections-of-a-design-brief\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#key-sections-of-a-design-brief\" target=\"_blank\" rel=\"noreferrer\">Key Sections of a Design Brief</a></h5>\n<ul>\n<li><strong>Project Information</strong>: quick information about the project</li>\n<li><strong>Background</strong> Why this project should exist?</li>\n<li><strong>Market</strong> All about market goals and competitors</li>\n<li><strong>Product</strong> Vision and mission of product, key UVP (unique value proposition)</li>\n<li><strong>Users</strong> Know target users, their needs, pain points and goals</li>\n<li><strong>Design Goals</strong> Design expectation, success indicator for evaluation of the design</li>\n</ul>\n<p>For each section, I provided a couple of questions to understand what should ask your client.</p>\n<figure class=\"mb-10\"><img loading=\"lazy\" src=\"https://res.cloudinary.com/mmdsharifi/image/upload/q_auto,f_auto,w_400/design_brief_sections.webp\" srcset=\"https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_400/mmdsharifi.com/design_brief_sections.webp 400w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_600/mmdsharifi.com/design_brief_sections.webp 600w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_768/mmdsharifi.com/design_brief_sections.webp 768w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_820/mmdsharifi.com/design_brief_sections.webp 820w, https://res.cloudinary.com/mmdsharifi/image/upload/dpr_auto,q_auto,w_1240/mmdsharifi.com/design_brief_sections.webp 1240w\" alt=\"Design Brief Sections\" width=\"400\" height=\"300\"><figcaption class=\"text-center text-sm mt-3 text-gray-600 dark:text-gray-200\">Design Brief Sections -- feel free to customize it based on your needs</figcaption></figure>\n<p>Before the meeting make sure to review the template and make your questions ready, during the meeting also write answers in your notebook as a draft, while you can record the meeting. (always ask before recording their voice)</p>\n<p>Finally, after the meeting, you can rewrite all of the answers in your Notion template as a live document. Might be you need multiple meetings to write your design brief completely.</p>\n<p><img src=\"https://thumbs.gfycat.com/ConsiderateCalculatingAnnelid-size_restricted.gif\" alt=\"meeting\"></p>\n<h4 id=\"3)-utilize-%26-update\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#3)-utilize-%26-update\" target=\"_blank\" rel=\"noreferrer\">3) Utilize &amp; Update</a></h4>\n<p>Through project, you can always update the design brief and definitely use it as your single source of truth for upcoming steps, like user research, competitor analysis and even the look and feel of the UI design to resonate with the client’s core value or unique value proposition.</p>\n<p>That is it! Now you're a magician 🧙‍♂️🪄</p>\n<h3 id=\"conclusion\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#conclusion\" target=\"_blank\" rel=\"noreferrer\">Conclusion</a></h3>\n<p>In this article, I share my knowledge about writing design briefs. It helps you be more creative, since you clearly understand project needs you can provide better solutions and increase your productivity by staying focused, prioritizing tasks, and allocating resources effectively. Write a design brief for your next project use the template provided to streamline your project, and see the magic! ✨</p>\n</div>\n",
      "date_published": "2023-04-28T00:00:00Z"
    },{
      "id": "https://mmdsharifi.com/posts/2023/02/finally-settled-with-11ty/",
      "url": "https://mmdsharifi.com/posts/2023/02/finally-settled-with-11ty/",
      "title": "Hello World!",
      "content_html": "<div class=\"col-start-3 col-end-9\">\n<h3 id=\"what-changed%3F\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#what-changed%3F\" target=\"_blank\" rel=\"noreferrer\">What Changed?</a></h3>\n<p>The web development landscape changed a lot in recent years. Developers moved to modern web development (<a href=\"https://jamstack.org/\" target=\"_blank\" rel=\"noreferrer\">JAMstack</a>) and become more specialised. There are now front-end, backend and full-stack web development stacks. I believe, front-end web development became the automatic choice for most developers with designer background.</p>\n<p>Other than that, WordPress evolved from a simple blogging platform to a <a href=\"https://fullsiteediting.com/\" target=\"_blank\" rel=\"noreferrer\">full-site-editing CMS</a> (soon). We kinda see that coming. After years of reviewing on ThemeForest, the demands for a full fledge CMS from WordPress are increasing and page builder is gaining popularity since the introduction of <a href=\"https://codecanyon.net/item/visual-composer-page-builder-for-wordpress/242431\" target=\"_blank\" rel=\"noreferrer\">WPBakery</a>.</p>\n<h3 id=\"static-site-generators\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#static-site-generators\" target=\"_blank\" rel=\"noreferrer\">Static Site Generators</a></h3>\n<p>I first encountered SSG back in 2017. I forgot the reason why I get into SSG but once I get started, I cannot stop. I tried <a href=\"https://www.gatsbyjs.com/\" target=\"_blank\" rel=\"noreferrer\">Gatsby</a> &amp; <a href=\"https://gohugo.io/\" target=\"_blank\" rel=\"noreferrer\">Hugo</a> but 11ty became my favourite.</p>\n<p>What fascinate me is the fact that we are using basic HTML/CSS again for building websites. This might sound like a return to the old ways of making sites but there are some key differences:</p>\n<ul>\n<li>SSG has improved over the years. You can basically get a site running within minutes.</li>\n<li>Different templating languages to choose from. Choose the one you like and go nuts.</li>\n<li>Automation became mainstream.</li>\n<li>It is secured, easy to scale and the performance is insane. These are also my main reasons of using SSG.</li>\n</ul>\n<p><strong>SSG</strong> simply makes more sense for most company static websites with minimal interaction or less-frequent content update.</p>\n<h4 id=\"gatsby\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#gatsby\" target=\"_blank\" rel=\"noreferrer\">Gatsby</a></h4>\n<p><a href=\"https://www.gatsbyjs.com/\" target=\"_blank\" rel=\"noreferrer\">Gatsby</a> is my first attempt to the SSG world. Well, I have my personal reason behind this. WordPress started using <a href=\"https://reactjs.org/\" target=\"_blank\" rel=\"noreferrer\">React</a> for <a href=\"https://wordpress.org/gutenberg/\" target=\"_blank\" rel=\"noreferrer\">Gutenberg</a> and it's just a good timing to learn React. There is definitely a learning curve when dealing with Gatsby while learning ReactJS at the same time. However, the performance of Gatsby is no doubt one of the best.</p>\n<p>I found this article by <a href=\"https://brycewray.com/posts/2019/07/why-staying-with-hugo\" target=\"_blank\" rel=\"noreferrer\">Bryce Wray</a> who has the similar struggle or experience with Gatsby. The plugins dependencies and those errors / warnings in the CLI are driving me crazy. There is this <em>uncertainty</em> playing in head every time I install / run a build. Further, I find it is an overkilled to use Gatsby for personal blog.</p>\n<h4 id=\"hugo\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#hugo\" target=\"_blank\" rel=\"noreferrer\">Hugo</a></h4>\n<p>The thing about <a href=\"https://gohugo.io/\" target=\"_blank\" rel=\"noreferrer\">Hugo</a> is that it feels lightweight, I was intrigued by the reported build speed. Site as big as <a href=\"https://www.smashingmagazine.com/2019/05/switch-wordpress-hugo/\" target=\"_blank\" rel=\"noreferrer\">SmashingMagazine</a> is build on Hugo, this won't go wrong. So I dive in, having fun building my personal site 2.0 on Hugo using Go's html/template which based on <a href=\"https://golang.org/\" target=\"_blank\" rel=\"noreferrer\">Golang</a>. I'd recommend Hugo to anyone who would like to try SSG, I may still try it for a few small projects in the future.</p>\n<p>The <a href=\"https://gohugo.io/content-management/archetypes/\" target=\"_blank\" rel=\"noreferrer\">Archetypes</a> feature is really handy and I really hope I can do the same with 11ty.</p>\n<h4 id=\"11ty\" tabindex=\"-1\"><a class=\"header-anchor\" href=\"#11ty\" target=\"_blank\" rel=\"noreferrer\">11ty</a></h4>\n<p><a href=\"https://www.11ty.dev/\" target=\"_blank\" rel=\"noreferrer\">Eleventy</a> is fairly new, if comparing to Gatsby and Hugo. It supports plugins and you can write it in multiple template languages, you can pick one or use them all together!</p>\n<p>Eleventy seems to have all the features I wanted ( no archetypes tho ), fast-enough build speed, easy-to-use collections to group content. Further, I can add shortcodes easily for easy content management. The folder system is simple, dummy proof.</p>\n</div>\n<div class=\"col-start-2 col-end-10\">\n</div>\n<div class=\"col-start-3 col-end-9\">\n<p>This site is built with <a href=\"https://github.com/mmdsharifi/mmdsharifi.com\" target=\"_blank\" rel=\"noreferrer\">11ty &amp; TailwindCSS</a>. It scores the magic 400 on Google Lighthouse.</p>\n</div>\n",
      "date_published": "2023-02-12T00:00:00Z"
    }
  ]
}